#### Terraform Format and Style 
#### Terraform Initialization 
#### Terraform Validation 
#### Terraform Plan 📄

<details><summary>Show Plan</summary>

```hcl
module.network.aws_vpc.demo-vpc: Refreshing state... [id=vpc-0fbfefcfc43f799f8]
module.network.aws_route_table.private-routing-table: Refreshing state... [id=rtb-099952af687498ecc]
module.network.aws_subnet.public-subnets[1]: Refreshing state... [id=subnet-090fbdcee6f1d3a04]
module.network.aws_subnet.public-subnets[0]: Refreshing state... [id=subnet-059d651043e7a874f]
module.network.aws_internet_gateway.demo-igw: Refreshing state... [id=igw-03a0e116482db2ad2]
module.network.aws_subnet.private-subnets[0]: Refreshing state... [id=subnet-0522bfe2e15cd90ae]
module.security_groups.aws_security_group.web_sg: Refreshing state... [id=sg-0d0af853430913fc0]
module.network.aws_subnet.private-subnets[1]: Refreshing state... [id=subnet-04bbaf87ee5031b2b]
module.network.aws_route_table.public-routing-table: Refreshing state... [id=rtb-079e8f4c1464d5bab]
module.network.aws_route_table_association.private-subnets[0]: Refreshing state... [id=rtbassoc-04d3c25a17178525c]
module.network.aws_route_table_association.private-subnets[1]: Refreshing state... [id=rtbassoc-070486c4b0096aab2]
module.security_groups.aws_security_group.db_sg: Refreshing state... [id=sg-0845b7af993b058d3]
module.focalboard.aws_instance.web-servers: Refreshing state... [id=i-0b2d49ce683324b54]
module.network.aws_route_table_association.public-subnets[0]: Refreshing state... [id=rtbassoc-0d4cd17949f33fbc3]
module.network.aws_route_table_association.public-subnets[1]: Refreshing state... [id=rtbassoc-0d8c1c092aeddd0fb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb.aws_lb.web_lb will be created
  + resource "aws_lb" "web_lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "web-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0d0af853430913fc0",
        ]
      + subnets                                                      = [
          + "subnet-059d651043e7a874f",
          + "subnet-090fbdcee6f1d3a04",
        ]
      + tags                                                         = {
          + "Name" = "TerraformProject"
        }
      + tags_all                                                     = {
          + "Name" = "TerraformProject"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.web_listener will be created
  + resource "aws_lb_listener" "web_listener" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_target_group.web_tg will be created
  + resource "aws_lb_target_group" "web_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "web-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "TerraformProject"
        }
      + tags_all                           = {
          + "Name" = "TerraformProject"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0fbfefcfc43f799f8"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_lb_target_group_attachment.web_tg_attachment will be created
  + resource "aws_lb_target_group_attachment" "web_tg_attachment" {
      + id               = (known after apply)
      + port             = 8000
      + target_group_arn = (known after apply)
      + target_id        = "i-0b2d49ce683324b54"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @devops979, Action: `pull_request`*